 [{"name": "Squash, bacon, and feta breakfast bake",
  "ingredients": " 1 3 pound spaghetti squash \n 2 eggs, lightly beaten \n 1/3 cup finely shredded Parmesan cheese \n 3 tablespoons all-purpose flour \n 2 tablespoons snipped fresh sage \n 6 slices lower sodium less fat bacon, coarsely chopped \n 3 cups coarsely chopped, trimmed Swiss chard \n 2 ounces reduced-fat feta cheese, crumbled (about 1/3 cup) \n 6 eggs \n 1/4 teaspoon salt \n 1/4 teaspoon ground black pepper",
  "steps": " 1. Preheat oven to 375 degrees F. Line a small baking pan with parchment paper. Cut spaghetti squash in half crosswise. Use a spoon to scoop out and discard seeds and strings. Place squash halves, cut sides down, on prepared baking pan. Bake about 1 hour or until squash is tender when pierced with a sharp knife. Cool completely on a wire rack. Reduce oven temperature to 350 degrees F. \n 2.   For crust, in a large bowl combine lightly beaten eggs, Parmesan cheese, flour, and sage. Using a fork, scrape squash pulp into the bowl with the egg mixture. Gently stir until well combined. Spread mixture evenly in a greased 2-quart rectangular baking dish. Bake, uncovered, about 20 minutes or until crust is set and edges start to brown. \n 3. Meanwhile, in a large nonstick skillet cook bacon over medium heat until just browned but not crisp. Using a slotted spoon, transfer bacon to a small bowl. Discard bacon drippings. Spray skillet with cooking spray. Add chard to skillet; cook and stir for 1 minute. \n 4. Top squash crust with chard, feta cheese, and bacon. Bake, uncovered, about 5 minutes more or until heated through. \n 5. Coat the same skillet with nonstick cooking spray. Heat skillet over medium heat. Break three eggs into skillet, keeping eggs separate. Sprinkle with half of the salt and half of the pepper. Reduce heat to low; cook eggs for 3 to 4 minutes or until whites are completely set and yolks start to thicken. Remove from heat for sunny-side-up eggs. For fried eggs over easy or over hard, when the whites are completely set and yolks start to thicken, turn the eggs and cook for 30 seconds more (for over easy) or 1 minute more (for over hard). Remove eggs from the skillet; keep warm. Repeat with remaining three eggs and remaining salt and pepper. \n 6. To serve, cut baked casserole into six equal portions and place on six serving plates. Top each portion with an egg.",
  "isFavourite": false,
  "category": "Main course"
  },
  {"name": "Greek chicken-quinoa salad",
  "ingredients": " 3 tablespoons white wine vinegar \n 1 tablespoon lemon juice \n 1 tablespoon olive oil \n 1 clove garlic, minced \n 1/4 teaspoon salt \n 1/8 teaspoon ground black pepper \n 1 English cucumber (seedless), peeled, halved and sliced \n 1 pint grape tomatoes, halved \n 1/4 large red onion, chopped \n 1/4 cup chopped fresh dill \n 2 1/2 cups cooked quinoa \n 4 cooked chicken breasts, diced \n 1/4 cup reduced-fat feta cheese",
  "steps": " 1. In a large bowl, whisk together vinegar, lemon juice, oil, garlic, salt and pepper. Stir in cucumber, tomatoes, onion and dill; mix to combine. Let stand 10 minutes. \n 2. Meanwhile, combine quinoa and chicken in a medium bowl and microwave until warm, 4 minutes. Stir quinoa-chicken mixture into bowl with vegetables. Divide among serving plates and top with feta.",
  "isFavourite": false,
  "category": "Salads"
  },
  {"name": "Greek chicken-quinoa salad",
  "ingredients": " 3 tablespoons white wine vinegar \n 1 tablespoon lemon juice \n 1 tablespoon olive oil \n 1 clove garlic, minced \n 1/4 teaspoon salt \n 1/8 teaspoon ground black pepper \n 1 English cucumber (seedless), peeled, halved and sliced \n 1 pint grape tomatoes, halved \n 1/4 large red onion, chopped \n 1/4 cup chopped fresh dill \n 2 1/2 cups cooked quinoa \n 4 cooked chicken breasts, diced \n 1/4 cup reduced-fat feta cheese",
  "steps": " 1. In a large bowl, whisk together vinegar, lemon juice, oil, garlic, salt and pepper. Stir in cucumber, tomatoes, onion and dill; mix to combine. Let stand 10 minutes. \n 2. Meanwhile, combine quinoa and chicken in a medium bowl and microwave until warm, 4 minutes. Stir quinoa-chicken mixture into bowl with vegetables. Divide among serving plates and top with feta.",
  "isFavourite": false,
  "category": "Salads"
  }
  ]